Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Unregisters an adlib function.
fr: Annule l'enregistrement d'une fonction AdLib.

source: The name of the adlib function to be Unregistered.
fr: Nom de la fonction adlib dont l'enregistrement doit être annulée.

source: See remarks for more information.
fr: Consultez Remarques pour plus d'informations.

source: Returns the number of adlib functions currently registered.
fr: Retourne le nombre de fonctions adlib enregistrées.

source: If the function name is not specified then the last registered function will be unregistered.
fr: Si le nom de la fonction n'est pas renseigné, la dernière fonction enregistrée sera annulée.

source: Array user defined functions Reference
fr: Array - Référence

source: Below is a complete list of the user defined functions available in AutoIt.
fr: Voici une liste complète des fonctions UDF de la rubrique.

source: Click on a user defined function name for a detailed description.
fr: Cliquez sur le nom pour une description détaillée.

source: When using them you need to add a #include <Array.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Array.au3>.

source: Uses the binary search algorithm to search through a 1D or 2D array
fr: Utilise l'algorithme de recherche binaire dans un tableau trié 1D ou 2D

source: Returns an array of the combinations of a set of elements from a selected 1D array
fr: Retourne le tableau des combinaisons de taille donnée de l'ensemble des éléments d'un tableau

source: Returns the ASCII code of a character.
fr: Retourne le code ASCII d'un caractère.

source: The character to get the code for.
fr: Le caractère dont vous souhaitez obtenir le code ASCII.

source: If a string is used, the code for the first character is given.
fr: Si une chaine est utilisée, le code du premier caractère de la chaine est retourné.

source: Returns the ASCII code of the specified char.
fr: Retourne le code ASCII du caractère spécifié.

source: See the ASCII Character Code table for a complete list of available values.
fr: Consultezla table ASCII Character Code pour une liste de valeurs disponibles.

source: Returns the unicode code of a character.
fr: Retourne le code Unicode d'un caractère.

source: Returns the unicode code of the specified char.
fr: Retourne le code Unicode du caractère spécifié.

source: See "Unicode Support" for a detailed description.
fr: Consultez Support Unicode pour une description détaillée.

source: Calculates the arcsine of a number.
fr: Calcule l’arc-sinus d'un nombre.

source: Any value between -1 and 1 (inclusive).
fr: Toute valeur comprise entre -1 et 1 (inclus).

source: Returns the trigonometric arcsine of the number.
fr: Retourne l’arc-sinus trigonométrique du nombre.

source: ASin(x) is mathematically defined only for -1 < x < 1, so ASin() tends to return -1.#IND for other values of x.
fr: ASin(x) est défini mathématiquement pour -1 < x < 1, aussi ASin retourne -1.#IND (indéterminé) pour toutes les autres valeurs de x.

source: Assign a Local variable the arcSine of 0.5.
fr: Assigne une variable locale avec l'arc sinus de 0,5.

source: Example of using ASin with degrees
fr: Exemple d'utilisation de ASin avec des degrés

source: Assigns a variable by name with the data.
fr: Assigne des données à une variable définie par son nom.

source: The name of the variable you wish to assign.
fr: Nom de la variable pour laquelle vous souhaitez faire l'assignation.

source: Cannot be an array element and must only contain letters, digits and underscore characters (as per normal variable naming conventions).
fr: Ne peut pas être l'élément d'un tableau et doit contenir seulement des lettres, des chiffres et le caractère de soulignement (mêmes conventions que pour les noms de variable normale).

source: The data you wish to assign to the variable.
fr: Les données que vous souhaitez attribuer à la variable.

source: controls the way that variables are assigned (add required options together):
fr: Permet de contrôler la manière dont les variables sont crées.Peut être une combinaison des éléments suivants :

source: 0 = (default) Create variable if required
fr: 0 = (défaut) Créer la variable si besoin est.

source: 1 = Force creation in local scope
fr: 1 = Force la création d'une variable de portée locale.

source: 2 = Force creation in global scope
fr: 2 = Force la création d'une variable de portée globale.

source: 4 = Fail if variable does not already exist
fr: 4 = Échec si la variable n'est pas déjà définie.

source: 0 if unable to create/assign the variable.
fr: Retourne 0 si incapacité de créer/assigner la variable.

source: If there is a need to use Assign() to create/write to a variable, then in most situations, Eval() should be used to read the variable and IsDeclared() should be used to check that the variable exists.
fr: Si vous avez besoin d'utiliser Assign() pour créer ou écrire dans une variable, alors dans la plupart des situations Eval() devra être utilisée pour lire la variable , et IsDeclared() sera utilisée pour vérifier que la variable existe.

source: Assign the variable string sString with data.
fr: Assigne la variable chaîne sString avec une donnée.

source: Find the value of the variable string sString and assign to the variable $sEvalString.
fr: Réupère la valeur de la variable chaîne sString et l'affecte à la variable $sEvalString.

source: Display the value of $sEvalString.
fr: Affiche la valeur de $sEvalString.

source: This should be the same value as $sString.
fr: Cela devrait être la même valeur que $sChaine.

source: Calculates the arctangent of a number.
fr: Calcule l’arc tangente d'un nombre.

source: Returns the trigonometric arctangent of the number.
fr: Retourne l’arc tangente trigonométrique du nombre.

source: The result of 4 * ATan(1) is pi.
fr: Le résultat de 4 * ATan(1) est pi.

source: Assign a Local variable the arcTangent of 0.5.
fr: Assigne une variable locale avec l'arctangente de 0,5.

source: Example of using ATan with degrees
fr: Exemple d'utilisation de ATan avec des degrés

source: Changes the operation of various AutoIt functions/parameters.
fr: Change le mode de fonctionnement de divers fonctions/paramètres d'AutoIt.

source: The option to change.See Remarks.
fr: L'option à changer (voir Remarques).

source: The value to assign to the option.
fr: La valeur à assigner à l'option.

source: The type and meaning vary by option.
fr: Le type et la signification varient selon l'option.

source: See remarks below.
fr: Voir Remarques ci-dessous.

source: If the param is not provided, then the function just returns the value already assigned to the option.
fr: Si le paramètre n'est pas indiqué, alors la fonction retourne la valeur qui lui est assignée.

source: The keyword Default can be used for the parameter to reset the option to its default value.
fr: Le mot clé Default peut être utilisé en paramètre pour réinitialiser la valeur par défaut de l'option.

source: the value of the previous setting for the option.
fr: Retourne la valeur du paramètre précédent pour l'option.

source: Failure will occur if the parameters are invalid (such as an option that does not exist).
fr: L'échec peut se produire si les paramètres sont invalides (tel qu'un paramètre qui n'existe pas).

source: You may use Opt() as an alternative to AutoItSetOption().
fr: Vous pouvez utiliser Opt() comme alternative à AutoItSetOption().

source: Options are as follows:
fr: Les paramètres sont les suivants :

source: Sets the way coords are used in the caret functions, either absolute coords or coords relative to the current active window:
fr: Détermine la manière dont les coordonnées sont utilisées dans les fonctions 'caret'.soit coordonnées absolues ou coordonnées relatives à la fenêtre active courante :

source: 0 = relative coords to the active window
fr: 0 = Coordonnées relatives à la fenêtre active

source: 1 = (default) absolute screen coordinates
fr: 1 = (par défaut) Coordonnées absolues dans l'écran

source: 2 = relative coords to the client area of the active window
fr: 2 = Coordonnées relatives à la zone client de la fenêtre active

source: Changes how literal strings and % symbols are interpreted.
fr: Change la méthode d'interprétation des chaînes littérales et des symboles %.

source: By default strings are treated literally, this option allows you to use %environment% variables inside strings, e.g.,
fr: Par défaut les chaînes sont traitées littéralement.Ce paramètre vous permet d'utiliser les variables %environnement% à l'intérieur des chaînes.

source: "The temp directory is:
fr: Exemple :"Le répertoire temporaire est :

source: 0 = (default) do not expand environment variables
fr: 0 = (défaut) N'étend pas les variables d'environnement

source: 1 = expand environment variables
fr: 1 = Étend les variables d'environnement (similaire à AutoIt v2)

source: Without this option the usual way would be:
fr: Sans ce paramètre, la méthode classique est :

source: Changes how literal strings and variable/macro ($ and @) symbols are interpreted.
fr: Change la méthode d'interprétation des chaînes littérales et des symboles variable/macro ($ et @).

source: By default strings are treated literally, this option allows you to use variables and macros inside strings, e.g.,
fr: Par défaut les chaînes sont traitées littéralement.Ce paramètre vous permet d'utiliser les variables et le macros à l'intérieur des chaînes.

source: "The value of var1 is $var1$".
fr: Exemple :"La valeur de var1 est $var1$".

source: 0 = (default) do not expand variables
fr: 1 = Étend les variables (Lorsque vous êtes dans ce mode et que vous voulez utiliser les symboles $ ou @ alors doublez les :"Ceci est le symbole dollar $$".

source: 1 = expand variables (when in this mode and you want to use a literal $ or @ then double it up:"This is a single dollar $$ sign".
fr: 0 = (par défaut) N'étend pas les variables

source: When ESC is pressed on a GUI the $GUI_EVENT_CLOSE message is sent.
fr: Lorsque la touche ESC est appuyée dans une GUI le message $GUI_EVENT_CLOSE est envoyé.

source: This option toggles this behavior on and off.
fr: Ce paramètre alterne ce comportement sur On et Off.

source: 0 = Don't send the $GUI_EVENT_CLOSE message when ESC is pressed.
fr: 0 = N'envoie pas le message $GUI_EVENT_CLOSE lorsque la touche ESC est appuyée.

source: 1 = (default) Send() the $GUI_EVENT_CLOSE message when ESC is pressed.
fr: 1 = (défaut) Send() le message $GUI_EVENT_CLOSE lorsque la touche ESC est appuyée.

source: Alters the position of a control defined by GUICtrlSetPos().
fr: Modifie la position d'un contrôle défini par GUICtrlSetPos().

source: 0 = relative position to the start of the last control (upper left corner).
fr: 0 = position relative du coin haut/gauche du dernier contrôle.

source: 1 = (default) absolute coordinates still relative to the dialog box.
fr: 1 = (défaut) Coordonnées absolues toujours relatives à la boite de dialogue.

source: 2 = cell positioning relative to current cell.
fr: 2 = Positionnement de cellule relative à la cellule actuelle.

source: A -1 for left or top parameter don't increment the start.
fr: Un -1 en paramètre gauche ou haut n'incrémente pas le début.

source: So next line is -1, offset; next cell is offset,-1; current cell is -1,-1.
fr: Donc la ligne est -1,offset; la cellule est offset,-1; la cellule actuelle est -1,-1.

source: Obviously "offset" cannot be -1 which reserved to indicate the no increment.
fr: Évidemment le 'offset' ne peut être égal à -1 qui est réservé pour indiquer la non-incrémentation.

source: But if you can use a multiple of the width you choose to skip or go back.
fr: Mais si vous pouvez utiliser un multiple de la largeur vous choisissez de sauter ou revenir.

source: Define the character which delimits subitems in GUICtrlSetData().
fr: Définit le caractère de délimitation des sous-éléments dans GUICtrlSetData().

source: The default character is '|'.
fr: Le caractère par défaut est '|'.

source: Enable/disable OnEvent functions notifications.
fr: Active/Désactive les fonctions de notification du mode événementiel.

source: 0 = (default) disable.
fr: 0 = (défaut) Désactive.

source: 1 = enable.
fr: 1 = Active.

source: Change default resizing for a control.
fr: Change le mode de redimensionnement par défaut d'un contrôle.

source: 0 = (default) keep default control resizing.
fr: 0 = (défaut) Garde le mode de redimensionnement par défaut .

source: <1024 = any type of resizing see GUICtrlSetResizing().
fr: <1024 = n'importe quel type de redimensionnement.Consultez GUICtrlSetResizing.

source: Change special event behavior or GUI function return values.
fr: Change le comportement d'événement spécial ou les valeurs de retour de fonction graphique.

source: 0 = (default) Windows behavior on click on Minimize,Restore, Maximize, Resize.
fr: 0 = (défaut) Comportement normal de fenêtres au clic sur réduction, rétablissement, maximisation, redimensionnement .

source: 1 = suppress windows behavior on minimize, restore or maximize click button or window resize.
fr: 1 = Supprime le comportement normal de fenêtres au clic sur réduction, rétablissement, maximisation, redimensionnement.

source: Just sends the notification.
fr: Envoi la notification seulement.

source: Alters the length of the brief pause in between mouse clicks.
fr: Modifie la durée de la pause entre les clics de souris.

source: Time in milliseconds to pause (default=10).
fr: Temps de pause en millisecondes (défaut = 10).

source: Alters the length a click is held down before release.
fr: Modifie la durée de maintient du clic avant relâchement.

source: Alters the length of the brief pause at the start and end of a mouse drag operation.
fr: Modifie la durée de la pause entre le début et à la fin d'une opération de déplacement.

source: Time in milliseconds to pause (default=250).
fr: Temps de pause en millisecondes (défaut = 250).

source: Sets the way coords are used in the mouse functions, either absolute coords or coords relative to the current active window:
fr: Détermine la manière d'utiliser les coordonnées dans les fonctions de souris, soit coordonnées absolues ou coordonnées relatives à la fenêtre active courante :

source: If this option is used then all variables must be pre-declared with Local, Global or in some cases Dim before they can be used - removes the chance for misspelled variables causing bugs.
fr: Si ce paramètre est utilisée, alors toutes les variables doivent être pré-déclarées avec Dim, Local ou Global avant d'être utilisées - Évite la mauvaise orthographe de variables qui cause parfois des bogues.

source: 0 = (default) Variables don't need to be pre-declared
fr: 0 = (défaut) Les variables n'ont pas besoin d'être pré-déclarée

source: 1 = Variables must be pre-declared.
fr: 1 = Les variables doivent être pré-déclarées.

source: See Dim / Global / Local / Const for details on declaring variables.
fr: Consultez Dim / Global / Local / Const pour des détails sur la déclaration des variables.

source: Sets the way coords are used in the pixel functions, either absolute coords or coords relative to the window defined by hwnd (default active window):
fr: Détermine la manière d'utiliser les coordonnées dans les fonctions pixel, soit coordonnées absolues ou coordonnées relatives à la fenêtre définie par hwnd (fenêtre active par défaut) :

source: 0 = relative coords to the defined window
fr: 0 = Coordonnées relatives à la fenêtre définie

source: 2 = relative coords to the client area of the defined window
fr: 2 = Coordonnées relatives à la zone client de la fenêtre définie

source: Specifies if AutoIt attaches input threads when using Send() function.
fr: Spécifie si AutoIt attache les threads d'entrée lors de l'utilisation de la fonction Send().

source: When not attaching (default mode=0) detecting the state of capslock/scrolllock and numlock can be unreliable under NT4.
fr: Sans l'attachement (mode par défaut = 0) la détection de l'état de capslock/scrolllock et numlock peut être incertaine sous NT4.

source: However, when you specify attach mode=1 the Send("{... down/up}") syntax will not work and there may be problems with sending keys to "hung" windows.
fr: Toutefois, lorsque vous spécifiez le mode d'attachement mode = 1, la syntaxe Send("{...down/up}") ne fonctionnera pas et il peut y avoir des problèmes avec l'envoi de touches aux fenêtres "bloquées".

source: ControlSend() ALWAYS attaches and is not affected by this mode.
fr: ControlSend() attache TOUJOURS et n'est pas affecté par ce mode.

source: 0 = (default) don't attach
fr: 0 = (défaut)N'attache pas

source: 1 = attach
fr: 1 = Attache

source: Specifies if AutoIt should store the state of capslock before a Send() function and restore it afterwards.
fr: Spécifie si AutoIt devrait stocker l'état de verrouillage en majuscules avant une fonction Send() et la restaurer après.

source: 0 = don't store/restore
fr: 0 = Ne stocke/restaure pas

source: 1 = (default) store and restore
fr: 1 = (défaut) Stocke et restaure

source: Alters the length of the brief pause in between sent keystrokes.
fr: Modifie la durée de la pause entre les envois de frappe clavier.

source: A value of 0 removes the delay completely.
fr: Une valeur de 0 supprime complètement la pause.

source: Time in milliseconds to pause (default=5).
fr: Temps de pause en millisecondes (défaut=5).

source: Alters the length of time a key is held down before being released during a keystroke.
fr: Modifie le délais de maintient d'une touche avant qu'elle ne soit relâchée lors d'une frappe clavier.

source: For applications that take a while to register keypresses you may need to raise this value from the default.
fr: Pour les applications qui prennent un certain temps pour enregistrer l'appui de touches, (et certains jeux) vous aurez besoin d'augmenter cette valeur.

source: Defines the time before TCP functions stop if no communication.
fr: Définit la durée avant que les fonctions TCP ne s’arrêtent si il n'y a pas de communication.

source: Time in milliseconds before timeout (default=100).
fr: Délai d'attente en millisecondes (défaut=100).

source: Script pauses when click on tray icon.
fr: Met en pause le script lors d'un clic sur l'icône de la zone de notification.

source: 0 = no pause
fr: 0 = Pas de pause

source: 1 = (default) pause.
fr: 1 = (défaut) Pause.

source: If there is no DefaultMenu no pause will occurs.
fr: Si il n'y a pas de menu par défaut, aucune pause n'aura lieu.

source: If enabled shows the current script line in the tray icon tip to help debugging.
fr: Si activé, montre la ligne en cours du script, dans une bulle d'information de la zone de notification pour aider au débogage.

source: 0 = (default) no debug information
fr: 0 = (défaut) Aucune informations de débogage

source: 1 = show debug
fr: 1 = Montre les informations de débogage

source: Hides the AutoIt tray icon.
fr: Cache l'icône d'AutoIt située dans la zone de notification.

source: The icon will still initially appear for ~750 milliseconds.
fr: L'icône apparaitra ~750 millisecondes lors de l'initialisation.

source: 0 = (default) show icon
fr: 0 = (défaut) Montre l'icône

source: 1 = hide icon
fr: 1 = Cache l'icône

source: Extend the behaviour of the script tray icon/menu.
fr: Étend le comportement de l'icône/menu de la zone de notification.

source: This can be done with a combination (adding) of the following values.
fr: Ceci peut être fait avec une combinaison (addition) des valeurs suivantes:

source: 0 = (default) default menu items (Script Paused/Exit) are appended to the usercreated menu; usercreated checked items will automatically unchecked; if you double click the tray icon then the controlID is returned which has the "Default"-style.
fr: 0 = Les éléments du menu par défaut (Script Paused/Exit) sont ajoutés au menu créer.Les éléments activés par l'utilisateur seront automatiquement désactivés; si vous double-cliquez sur l'icône de la zone de notification alors le controlID est retourné avec le style "default".

source: 1 = no default menu
fr: 1 = Pas de menu par défaut

source: 2 = user created checked items will not automatically unchecked if you click it
fr: 2 = Les éléments activés par l'utilisateur ne seront pas désactivés si vous cliquez dessus.

source: 4 = don't return the menuitemID which has the "default"-style in the main contextmenu if you double click the tray icon
fr: 4 = Ne retourne pas le menuitemID avec le style "default" dans le menu contextuel principal si vous double-cliquez sur l'icône de la zone de notification.

source: 8 = turn off auto check of radio item groups
fr: 8 = Désactive l'auto activation d'élément des groupes radio

source: Enable/disable OnEvent functions notifications for the tray.
fr: Active/Désactive la notification des fonctions OnEvent dans la zone de notification.

source: 0 = (default) disable
fr: 0 = (défaut) Désactivé

source: 1 = enable
fr: 1 = Activé

source: Specifies if hidden window text can be "seen" by the window matching functions.
fr: Spécifie si le texte des fenêtres cachées peut être "vu" par les fonctions de comparaison de fenêtre.

source: 0 = (default) Do not detect hidden text
fr: 0 = (défaut) Ne détecte pas le texte caché

source: 1 = Detect hidden text
fr: 1 = Détecte le texte caché

source: Allows the window search routines to search child windows as well as top-level windows.
fr: Permet aux routines de recherche de fenêtres, la recherche de fenêtres enfants aussi bien que des fenêtres de haut niveau.

source: 0 = (default) Only search top-level windows
fr: 0 = (défaut) Cherche les fenêtres de haut niveau seulement

source: 1 = Search top-level and child windows
fr: 1 = Cherche les fenêtres de haut niveau et enfants

source: Alters the method that is used to match window text during search operations.
fr: Change la méthode de comparaison du texte de fenêtre pendant les opérations de recherche.

source: 1 = (default) Complete / Slow mode
fr: 1 = (défaut) Complète / Mode lent

source: 2 = Quick mode
fr: 2 = Mode rapide

source: In quick mode AutoIt can usually only "see" dialog text, button text and the captions of some controls.In the default mode much more text can be seen (for instance the contents of the Notepad window).
fr: Dans le mode rapide, AutoIt ne "voit" que le texte des boites de dialogue, le texte des boutons et la légende de quelques contrôles.

source: If you are having performance problems when performing many window searches then changing to the "quick" mode may help.
fr: Dans le mode par défaut, beaucoup plus de texte peut être vu (par exemple le contenu de la fenêtre bloc-notes).

source: Alters the method that is used to match window titles during search operations.
fr: Si vous avez des problèmes de performance lors de multiples recherches de fenêtres, alors le passage en mode "rapide" pourra aider.

source: 1 = (default) Match the title from the start
fr: Change la méthode de comparaison du titre des fenêtres pendant les opérations de recherche.

source: 2 = Match any substring in the title
fr: 1 = (défaut) Compare le titre du début

source: 3 = Exact title match
fr: 2 = Compare n'importe quelle sous-chaîne dans le titre

source: 4 = Advanced mode (retained for backwards compatibility only - see Window Titles & Text (Advanced))
fr: 3 = Compare l'exactitude du titre

source: -1 to -4 = Case insensitive match according to the other type of match.
fr: 4 = Mode avancé (conservé seulement pour compatibilité antérieure), consultez Titre et texte d'une fenêtre (Avancé)

source: Alters how long a script should briefly pause after a successful window-related operation.
fr: -1 à -4 = force la comparaison en minuscule en accord avec l'autre type de comparaison.

source: copy any you want to change ;default value is listed first
fr: Exemple
